In [ ]:
!pip install mysql-connector-python
import mysql.connector as connector

connection = connector.connect(user="root2", password="yXo_ztj9389HWZr", host="localhost")
cursor = connection.cursor()
#wshow databases to check connection
cursor.execute("SHOW DATABASES")
results = cursor.fetchall()
for result in results:
    print(result)

In [62]:
#cursor.execute("DROP DATABASE littlelemondb")

In [75]:
cursor.execute("USE littlelemondb")
cursor.execute("SHOW Tables")
results = cursor.fetchall()
for result in results:
    print(result)

('bookings',)
('customers',)
('menuitems',)
('menus',)
('orderdeliverystatus',)
('orders',)
('ordersview',)
('staff',)

In [66]:
cursor.execute("DESCRIBE customers;")

In [68]:

results = cursor.fetchall()
for result in results:
    print(result)

('CustomerID', 'int', 'NO', 'PRI', None, '')
('FullName', 'varchar(255)', 'NO', '', None, '')
('Email', 'varchar(255)', 'NO', '', None, '')
('ContactNumber', 'varchar(45)', 'NO', '', None, '')

In [81]:
#*******************************************************#
# Insert query to populate "Orders" table:
#*******************************************************#
insert_stmt="""
INSERT INTO `LittleLemonDB`.`Orders` (`OrderID`, `Quantity`, `TotalCost`, `MenuID`, `BookingID`) VALUES
(1, 2, 19.98, 1, 1),
(2, 1, 9.99, 2, 2),
(3, 3, 29.97, 3, 3),
(4, 4, 39.96, 4, 4);
"""

cursor.execute(insert_stmt)
connection.commit()
cursor.execute("SELECT * FROM Orders")
results = cursor.fetchall()
for result in results:
    print(result)

DatabaseError: 1205 (HY000): Lock wait timeout exceeded; try restarting transaction

In [13]:
# Insert data from ChatGTP
# Used the following prompt: "To create SQL insert statements with test data for each table in the provided schema, I'll generate sample data for the Customers, Staff, Bookings, and OrderDeliveryStatus tables. Here are the insert statements with 20 rows of test data for each table:"

#*******************************************************#
# Insert query to populate "Customers" table:
#*******************************************************#
insert_customers="""
INSERT INTO `littlelemondb`.`customers` (`CustomerID`, `FullName`, `Email`, `ContactNumber`) VALUES
(1, 'John Doe', 'john.doe@example.com', '123-456-7890'),
(2, 'Jane Smith', 'jane.smith@example.com', '234-567-8901'),
(3, 'Alice Johnson', 'alice.j@example.com', '345-678-9012'),
(4, 'Bob Brown', 'bob.brown@example.com', '456-789-0123'),
(5, 'Charlie Davis', 'charlie.d@example.com', '567-890-1234'),
(6, 'Diana Evans', 'diana.evans@example.com', '678-901-2345'),
(7, 'Evan Green', 'evan.green@example.com', '789-012-3456'),
(8, 'Fiona Harris', 'fiona.h@example.com', '890-123-4567'),
(9, 'George King', 'george.k@example.com', '901-234-5678'),
(10, 'Hannah Lee', 'hannah.lee@example.com', '012-345-6789'),
(11, 'Ian Miller', 'ian.m@example.com', '123-456-7891'),
(12, 'Jack Nelson', 'jack.nelson@example.com', '234-567-8902'),
(13, 'Karen Owens', 'karen.o@example.com', '345-678-9013'),
(14, 'Liam Parker', 'liam.p@example.com', '456-789-0124'),
(15, 'Mia Quinn', 'mia.q@example.com', '567-890-1235'),
(16, 'Noah Roberts', 'noah.r@example.com', '678-901-2346'),
(17, 'Olivia Scott', 'olivia.s@example.com', '789-012-3457'),
(18, 'Paul Turner', 'paul.t@example.com', '890-123-4568'),
(19, 'Quinn Underwood', 'quinn.u@example.com', '901-234-5679'),
(20, 'Rachel Vance', 'rachel.v@example.com', '012-345-6790');
"""

In [15]:
#cursor.execute("DELETE FROM Customers;")

In [17]:
cursor.execute(insert_customers)
connection.commit()
cursor.execute("SELECT * FROM customers")
results = cursor.fetchall()
for result in results:
    print(result)

(1, 'John Doe', 'john.doe@example.com', '123-456-7890')
(2, 'Jane Smith', 'jane.smith@example.com', '234-567-8901')
(3, 'Alice Johnson', 'alice.j@example.com', '345-678-9012')
(4, 'Bob Brown', 'bob.brown@example.com', '456-789-0123')
(5, 'Charlie Davis', 'charlie.d@example.com', '567-890-1234')
(6, 'Diana Evans', 'diana.evans@example.com', '678-901-2345')
(7, 'Evan Green', 'evan.green@example.com', '789-012-3456')
(8, 'Fiona Harris', 'fiona.h@example.com', '890-123-4567')
(9, 'George King', 'george.k@example.com', '901-234-5678')
(10, 'Hannah Lee', 'hannah.lee@example.com', '012-345-6789')
(11, 'Ian Miller', 'ian.m@example.com', '123-456-7891')
(12, 'Jack Nelson', 'jack.nelson@example.com', '234-567-8902')
(13, 'Karen Owens', 'karen.o@example.com', '345-678-9013')
(14, 'Liam Parker', 'liam.p@example.com', '456-789-0124')
(15, 'Mia Quinn', 'mia.q@example.com', '567-890-1235')
(16, 'Noah Roberts', 'noah.r@example.com', '678-901-2346')
(17, 'Olivia Scott', 'olivia.s@example.com', '789-012-3457')
(18, 'Paul Turner', 'paul.t@example.com', '890-123-4568')
(19, 'Quinn Underwood', 'quinn.u@example.com', '901-234-5679')
(20, 'Rachel Vance', 'rachel.v@example.com', '012-345-6790')

In [19]:

#*******************************************************#
# Insert query to populate "Staff" table:
#*******************************************************#
insert_stmt="""
INSERT INTO `littlelemondb`.`staff` (`StaffID`, `StaffName`, `Role`, `Salary`) VALUES
(1, 'Sam Wilson', 'Manager', '50000'),
(2, 'Tina Adams', 'Chef', '40000'),
(3, 'Victor Blake', 'Waiter', '30000'),
(4, 'Wendy Clark', 'Waitress', '30000'),
(5, 'Xander Diaz', 'Bartender', '35000'),
(6, 'Yara Edwards', 'Host', '32000'),
(7, 'Zane Foster', 'Dishwasher', '28000'),
(8, 'Amy Grant', 'Sous Chef', '38000'),
(9, 'Ben Hall', 'Cook', '34000'),
(10, 'Cara Ingram', 'Server', '31000'),
(11, 'Dan Jacobs', 'Busser', '29000'),
(12, 'Ella Knight', 'Cashier', '30000'),
(13, 'Finn Lewis', 'Barista', '32000'),
(14, 'Gina Moore', 'Receptionist', '33000'),
(15, 'Hugo Nash', 'Cleaner', '27000'),
(16, 'Ivy Owens', 'Assistant Manager', '45000'),
(17, 'Jake Perry', 'Security', '36000'),
(18, 'Kara Quinn', 'Hostess', '32000'),
(19, 'Leo Reed', 'Delivery', '30000'),
(20, 'Mona Stone', 'Pastry Chef', '37000');
"""
cursor.execute(insert_stmt)
connection.commit()
cursor.execute("SELECT * FROM Staff")
results = cursor.fetchall()
for result in results:
    print(result)

(1, 'Sam Wilson', 'Manager', Decimal('50000.00'))
(2, 'Tina Adams', 'Chef', Decimal('40000.00'))
(3, 'Victor Blake', 'Waiter', Decimal('30000.00'))
(4, 'Wendy Clark', 'Waitress', Decimal('30000.00'))
(5, 'Xander Diaz', 'Bartender', Decimal('35000.00'))
(6, 'Yara Edwards', 'Host', Decimal('32000.00'))
(7, 'Zane Foster', 'Dishwasher', Decimal('28000.00'))
(8, 'Amy Grant', 'Sous Chef', Decimal('38000.00'))
(9, 'Ben Hall', 'Cook', Decimal('34000.00'))
(10, 'Cara Ingram', 'Server', Decimal('31000.00'))
(11, 'Dan Jacobs', 'Busser', Decimal('29000.00'))
(12, 'Ella Knight', 'Cashier', Decimal('30000.00'))
(13, 'Finn Lewis', 'Barista', Decimal('32000.00'))
(14, 'Gina Moore', 'Receptionist', Decimal('33000.00'))
(15, 'Hugo Nash', 'Cleaner', Decimal('27000.00'))
(16, 'Ivy Owens', 'Assistant Manager', Decimal('45000.00'))
(17, 'Jake Perry', 'Security', Decimal('36000.00'))
(18, 'Kara Quinn', 'Hostess', Decimal('32000.00'))
(19, 'Leo Reed', 'Delivery', Decimal('30000.00'))
(20, 'Mona Stone', 'Pastry Chef', Decimal('37000.00'))

In [21]:
#*******************************************************#
# Insert query to populate "Order Delivery Status" table:
#*******************************************************#
insert_stmt="""
INSERT INTO `littlelemondb`.`orderdeliverystatus` (`OrderDeliveryStatusID`, `DeliveryStatus`, `DeliveryDate`, `OrderID`) VALUES
(1, 'Delivered', '2023-10-01', 1),
(2, 'Pending', '2023-10-02', 2),
(3, 'In Transit', '2023-10-03', 3),
(4, 'Delivered', '2023-10-04', 4),
(5, 'Cancelled', '2023-10-05', 5),
(6, 'Pending', '2023-10-06', 6),
(7, 'In Transit', '2023-10-07', 7),
(8, 'Delivered', '2023-10-08', 8),
(9, 'Pending', '2023-10-09', 9),
(10, 'In Transit', '2023-10-10', 10),
(11, 'Delivered', '2023-10-11', 11),
(12, 'Cancelled', '2023-10-12', 12),
(13, 'Pending', '2023-10-13', 13),
(14, 'In Transit', '2023-10-14', 14),
(15, 'Delivered', '2023-10-15', 15),
(16, 'Pending', '2023-10-16', 16),
(17, 'In Transit', '2023-10-17', 17),
(18, 'Delivered', '2023-10-18', 18),
(19, 'Cancelled', '2023-10-19', 19),
(20, 'Pending', '2023-10-20', 20);
"""

cursor.execute(insert_stmt)
connection.commit()
cursor.execute("SELECT * FROM orderdeliverystatus")
results = cursor.fetchall()
for result in results:
    print(result)

(1, 'Delivered', datetime.date(2023, 10, 1), 1)
(2, 'Pending', datetime.date(2023, 10, 2), 2)
(3, 'In Transit', datetime.date(2023, 10, 3), 3)
(4, 'Delivered', datetime.date(2023, 10, 4), 4)
(5, 'Cancelled', datetime.date(2023, 10, 5), 5)
(6, 'Pending', datetime.date(2023, 10, 6), 6)
(7, 'In Transit', datetime.date(2023, 10, 7), 7)
(8, 'Delivered', datetime.date(2023, 10, 8), 8)
(9, 'Pending', datetime.date(2023, 10, 9), 9)
(10, 'In Transit', datetime.date(2023, 10, 10), 10)
(11, 'Delivered', datetime.date(2023, 10, 11), 11)
(12, 'Cancelled', datetime.date(2023, 10, 12), 12)
(13, 'Pending', datetime.date(2023, 10, 13), 13)
(14, 'In Transit', datetime.date(2023, 10, 14), 14)
(15, 'Delivered', datetime.date(2023, 10, 15), 15)
(16, 'Pending', datetime.date(2023, 10, 16), 16)
(17, 'In Transit', datetime.date(2023, 10, 17), 17)
(18, 'Delivered', datetime.date(2023, 10, 18), 18)
(19, 'Cancelled', datetime.date(2023, 10, 19), 19)
(20, 'Pending', datetime.date(2023, 10, 20), 20)

In [23]:
#*******************************************************#
# Insert query to populate "Menus" table:
#*******************************************************#
insert_stmt="""
INSERT INTO `littlelemondb`.`menus` (`MenuID`, `Cuisine`, `OrderID`) VALUES
(1, 'Italian', 1),
(2, 'Mexican', 2),
(3, 'Chinese', 3),
(4, 'Indian', 4),
(5, 'French', 5),
(6, 'Japanese', 6),
(7, 'Thai', 7),
(8, 'Greek', 8),
(9, 'Spanish', 9),
(10, 'American', 10),
(11, 'Italian', 11),
(12, 'Mexican', 12),
(13, 'Chinese', 13),
(14, 'Indian', 14),
(15, 'French', 15),
(16, 'Japanese', 16),
(17, 'Thai', 17),
(18, 'Greek', 18),
(19, 'Spanish', 19),
(20, 'American', 20);
"""

cursor.execute(insert_stmt)
connection.commit()
cursor.execute("SELECT * FROM menus")
results = cursor.fetchall()
for result in results:
    print(result)

(1, 'Italian', 1)
(2, 'Mexican', 2)
(3, 'Chinese', 3)
(4, 'Indian', 4)
(5, 'French', 5)
(6, 'Japanese', 6)
(7, 'Thai', 7)
(8, 'Greek', 8)
(9, 'Spanish', 9)
(10, 'American', 10)
(11, 'Italian', 11)
(12, 'Mexican', 12)
(13, 'Chinese', 13)
(14, 'Indian', 14)
(15, 'French', 15)
(16, 'Japanese', 16)
(17, 'Thai', 17)
(18, 'Greek', 18)
(19, 'Spanish', 19)
(20, 'American', 20)

In [25]:
cursor.execute("DESCRIBE orderdeliverystatus;")
results = cursor.fetchall()
for result in results:
    print(result)

('OrderDeliveryStatusID', 'int', 'NO', 'PRI', None, '')
('DeliveryStatus', 'varchar(45)', 'NO', '', None, '')
('DeliveryDate', 'date', 'NO', '', None, '')
('OrderID', 'int', 'NO', 'PRI', None, '')

In [27]:
#*******************************************************#
# Insert query to populate "Menu8Items" table:
#*******************************************************#
insert_stmt="""
INSERT INTO `littlelemondb`.`menuitems` (`MenuItemID`, `Name`, `Type`, `Price`, `MenuID`) VALUES
(1, 'Margherita Pizza', 'Main Course', 8.99, 1),
(2, 'Tacos', 'Main Course', 5.99, 2),
(3, 'Kung Pao Chicken', 'Main Course', 9.99, 3),
(4, 'Butter Chicken', 'Main Course', 10.99, 4),
(5, 'Croissant', 'Dessert', 2.99, 5),
(6, 'Sushi', 'Main Course', 12.99, 6),
(7, 'Pad Thai', 'Main Course', 8.99, 7),
(8, 'Moussaka', 'Main Course', 9.99, 8),
(9, 'Paella', 'Main Course', 11.99, 9),
(10, 'Burger', 'Main Course', 6.99, 10),
(11, 'Pasta Carbonara', 'Main Course', 9.49, 11),
(12, 'Burrito', 'Main Course', 7.99, 12),
(13, 'Spring Rolls', 'Appetizer', 4.99, 13),
(14, 'Samosa', 'Appetizer', 3.99, 14),
(15, 'Éclair', 'Dessert', 3.49, 15),
(16, 'Ramen', 'Main Course', 10.49, 16),
(17, 'Green Curry', 'Main Course', 9.49, 17),
(18, 'Gyro', 'Main Course', 7.49, 18),
(19, 'Churros', 'Dessert', 4.49, 19),
(20, 'Hot Dog', 'Main Course', 5.49, 20);
"""
cursor.execute(insert_stmt)
connection.commit()
cursor.execute("SELECT * FROM MenuItems")
results = cursor.fetchall()
for result in results:
    print(result)

(1, 'Margherita Pizza', 'Main Course', Decimal('8.99'), 1)
(2, 'Tacos', 'Main Course', Decimal('5.99'), 2)
(3, 'Kung Pao Chicken', 'Main Course', Decimal('9.99'), 3)
(4, 'Butter Chicken', 'Main Course', Decimal('10.99'), 4)
(5, 'Croissant', 'Dessert', Decimal('2.99'), 5)
(6, 'Sushi', 'Main Course', Decimal('12.99'), 6)
(7, 'Pad Thai', 'Main Course', Decimal('8.99'), 7)
(8, 'Moussaka', 'Main Course', Decimal('9.99'), 8)
(9, 'Paella', 'Main Course', Decimal('11.99'), 9)
(10, 'Burger', 'Main Course', Decimal('6.99'), 10)
(11, 'Pasta Carbonara', 'Main Course', Decimal('9.49'), 11)
(12, 'Burrito', 'Main Course', Decimal('7.99'), 12)
(13, 'Spring Rolls', 'Appetizer', Decimal('4.99'), 13)
(14, 'Samosa', 'Appetizer', Decimal('3.99'), 14)
(15, 'Éclair', 'Dessert', Decimal('3.49'), 15)
(16, 'Ramen', 'Main Course', Decimal('10.49'), 16)
(17, 'Green Curry', 'Main Course', Decimal('9.49'), 17)
(18, 'Gyro', 'Main Course', Decimal('7.49'), 18)
(19, 'Churros', 'Dessert', Decimal('4.49'), 19)
(20, 'Hot Dog', 'Main Course', Decimal('5.49'), 20)

In [29]:
#*******************************************************#
# Insert query to populate "Bookings" table:
#*******************************************************#
insert_stmt="""
INSERT INTO `littlelemondb`.`bookings` (`BookingID`, `BookingDate`, `TableNo`, `OrderID`, `CustomerID`, `StaffID`, `BookingSlot`) VALUES
(1, '2023-10-01', 1, 1, 1, 1, '19:00:00'),
(2, '2023-10-02', 2, 2, 2, 2, '20:00:00'),
(3, '2023-10-03', 3, 3, 3, 3, '17:00:00'),
(4, '2023-10-04', 4, 4, 4, 4, '16:00:00'),
(5, '2023-10-05', 5, 5, 5, 5, '19:00:00'),
(6, '2023-10-06', 6, 6, 6, 6, '17:00:00'),
(7, '2023-10-07', 7, 7, 7, 7, '19:00:00'),
(8, '2023-10-08', 8, 8, 8, 8, '15:00:00'),
(9, '2023-10-09', 9, 9, 9, 9, '18:00:00'),
(10, '2023-10-10', 10, 10, 10, 10, '19:00:00'),
(11, '2023-10-11', 11, 11, 11, 11, '17:00:00'),
(12, '2023-10-12', 12, 12, 12, 12, '15:00:00'),
(13, '2023-10-13', 13, 13, 13, 13, '19:00:00'),
(14, '2023-10-14', 14, 14, 14, 14, '14:00:00'),
(15, '2023-10-15', 15, 15, 15, 15, '18:00:00'),
(16, '2023-10-16', 16, 16, 16, 16, '19:00:00'),
(17, '2023-10-17', 17, 17, 17, 17, '21:00:00'),
(18, '2023-10-18', 18, 18, 18, 18, '19:00:00'),
(19, '2023-10-19', 19, 19, 19, 19, '19:00:00'),
(20, '2023-10-20', 20, 20, 20, 20, '20:00:00');
"""
cursor.execute(insert_stmt)
connection.commit()
cursor.execute("SELECT * FROM Bookings")
results = cursor.fetchall()
for result in results:
    print(result)

(1, datetime.date(2023, 10, 1), 1, datetime.timedelta(seconds=68400), 1, 1, 1)
(2, datetime.date(2023, 10, 2), 2, datetime.timedelta(seconds=72000), 2, 2, 2)
(3, datetime.date(2023, 10, 3), 3, datetime.timedelta(seconds=61200), 3, 3, 3)
(4, datetime.date(2023, 10, 4), 4, datetime.timedelta(seconds=57600), 4, 4, 4)
(5, datetime.date(2023, 10, 5), 5, datetime.timedelta(seconds=68400), 5, 5, 5)
(6, datetime.date(2023, 10, 6), 6, datetime.timedelta(seconds=61200), 6, 6, 6)
(7, datetime.date(2023, 10, 7), 7, datetime.timedelta(seconds=68400), 7, 7, 7)
(8, datetime.date(2023, 10, 8), 8, datetime.timedelta(seconds=54000), 8, 8, 8)
(9, datetime.date(2023, 10, 9), 9, datetime.timedelta(seconds=64800), 9, 9, 9)
(10, datetime.date(2023, 10, 10), 10, datetime.timedelta(seconds=68400), 10, 10, 10)
(11, datetime.date(2023, 10, 11), 11, datetime.timedelta(seconds=61200), 11, 11, 11)
(12, datetime.date(2023, 10, 12), 12, datetime.timedelta(seconds=54000), 12, 12, 12)
(13, datetime.date(2023, 10, 13), 13, datetime.timedelta(seconds=68400), 13, 13, 13)
(14, datetime.date(2023, 10, 14), 14, datetime.timedelta(seconds=50400), 14, 14, 14)
(15, datetime.date(2023, 10, 15), 15, datetime.timedelta(seconds=64800), 15, 15, 15)
(16, datetime.date(2023, 10, 16), 16, datetime.timedelta(seconds=68400), 16, 16, 16)
(17, datetime.date(2023, 10, 17), 17, datetime.timedelta(seconds=75600), 17, 17, 17)
(18, datetime.date(2023, 10, 18), 18, datetime.timedelta(seconds=68400), 18, 18, 18)
(19, datetime.date(2023, 10, 19), 19, datetime.timedelta(seconds=68400), 19, 19, 19)
(20, datetime.date(2023, 10, 20), 20, datetime.timedelta(seconds=72000), 20, 20, 20)